In [57]:
#import requests
from bs4 import BeautifulSoup
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import statsmodels.api as sm
from statsmodels.formula.api import ols
import statsmodels
from scipy import stats

In [58]:
realestate_df= pd.read_csv('data/real_estate.csv')
realestate_df

,type,zipcode,city,state,metro,county,size_rank,1996-04,1996-05,1996-06,...,2016-09,2016-10,2016-11,2016-12,2017-01,2017-02,2017-03,2017-04,2017-05,2017-06
0,ZHVI,10025,New York,NY,New York,New York,1,NaN,NaN,NaN,...,1137500,1137700,1152700,1156000.0,1140200,1130000,1131900,1149600,1198400,1247000
1,ZHVI,60657,Chicago,IL,Chicago,Cook,2,146700.0,146500.0,146300.0,...,318200,318100,318800,320200.0,320800,322000,323800,326100,327800,329100
2,ZHVI,60614,Chicago,IL,Chicago,Cook,3,198000.0,195500.0,194200.0,...,401900,406000,414100,417800.0,417400,418400,414100,404100,406400,415500
3,ZHVI,79936,El Paso,TX,El Paso,El Paso,4,70800.0,71000.0,71000.0,...,113800,113900,114100,114500.0,114900,115000,114700,114700,114800,114700
4,ZHVI,60640,Chicago,IL,Chicago,Cook,5,102300.0,101300.0,100700.0,...,198800,199200,200100,201500.0,203000,205100,206700,206500,206200,206700
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29106,ZRI,12720,Bethel,NY,NaN,Sullivan,15907,NaN,NaN,NaN,...,1185,1181,1174,1167.0,1156,1162,1175,1194,1202,1206
29107,ZRI,1338,Shelburne Falls,MA,Greenfield Town,Franklin,15908,NaN,NaN,NaN,...,1769,1772,1775,1780.0,1786,1790,1797,1798,1796,1795
29108,ZRI,21405,Annapolis,MD,Baltimore,Anne Arundel,15909,NaN,NaN,NaN,...,4048,4005,3888,3729.0,3563,3493,3474,3496,3488,3471
29109,ZRI,85220,Apache Junction,AZ,Phoenix,Pinal,15910,NaN,NaN,NaN,...,1007,1018,1035,1052.0,1061,1060,1058,1065,1074,1080
29110,ZRI,89595,Reno,NV,Reno,Washoe,15911,NaN,NaN,NaN,...,872,877,871,863.0,843,826,816,820,838,848

## Realestate Shape

In [59]:
print ('Real Estate shape: ', realestate_df.shape)

Real Estate shape:  (29111, 262)

## Real Estate Columns Name

In [60]:
print('Real Estate Column Names: ', realestate_df.columns.values)

Real Estate Column Names:  ['type' 'zipcode' 'city' 'state' 'metro' 'county' 'size_rank' '1996-04'
 '1996-05' '1996-06' '1996-07' '1996-08' '1996-09' '1996-10' '1996-11'
 '1996-12' '1997-01' '1997-02' '1997-03' '1997-04' '1997-05' '1997-06'
 '1997-07' '1997-08' '1997-09' '1997-10' '1997-11' '1997-12' '1998-01'
 '1998-02' '1998-03' '1998-04' '1998-05' '1998-06' '1998-07' '1998-08'
 '1998-09' '1998-10' '1998-11' '1998-12' '1999-01' '1999-02' '1999-03'
 '1999-04' '1999-05' '1999-06' '1999-07' '1999-08' '1999-09' '1999-10'
 '1999-11' '1999-12' '2000-01' '2000-02' '2000-03' '2000-04' '2000-05'
 '2000-06' '2000-07' '2000-08' '2000-09' '2000-10' '2000-11' '2000-12'
 '2001-01' '2001-02' '2001-03' '2001-04' '2001-05' '2001-06' '2001-07'
 '2001-08' '2001-09' '2001-10' '2001-11' '2001-12' '2002-01' '2002-02'
 '2002-03' '2002-04' '2002-05' '2002-06' '2002-07' '2002-08' '2002-09'
 '2002-10' '2002-11' '2002-12' '2003-01' '2003-02' '2003-03' '2003-04'
 '2003-05' '2003-06' '2003-07' '2003-08' '2003-09' '2003-10' '2003-11'
 '2003-12' '2004-01' '2004-02' '2004-03' '2004-04' '2004-05' '2004-06'
 '2004-07' '2004-08' '2004-09' '2004-10' '2004-11' '2004-12' '2005-01'
 '2005-02' '2005-03' '2005-04' '2005-05' '2005-06' '2005-07' '2005-08'
 '2005-09' '2005-10' '2005-11' '2005-12' '2006-01' '2006-02' '2006-03'
 '2006-04' '2006-05' '2006-06' '2006-07' '2006-08' '2006-09' '2006-10'
 '2006-11' '2006-12' '2007-01' '2007-02' '2007-03' '2007-04' '2007-05'
 '2007-06' '2007-07' '2007-08' '2007-09' '2007-10' '2007-11' '2007-12'
 '2008-01' '2008-02' '2008-03' '2008-04' '2008-05' '2008-06' '2008-07'
 '2008-08' '2008-09' '2008-10' '2008-11' '2008-12' '2009-01' '2009-02'
 '2009-03' '2009-04' '2009-05' '2009-06' '2009-07' '2009-08' '2009-09'
 '2009-10' '2009-11' '2009-12' '2010-01' '2010-02' '2010-03' '2010-04'
 '2010-05' '2010-06' '2010-07' '2010-08' '2010-09' '2010-10' '2010-11'
 '2010-12' '2011-01' '2011-02' '2011-03' '2011-04' '2011-05' '2011-06'
 '2011-07' '2011-08' '2011-09' '2011-10' '2011-11' '2011-12' '2012-01'
 '2012-02' '2012-03' '2012-04' '2012-05' '2012-06' '2012-07' '2012-08'
 '2012-09' '2012-10' '2012-11' '2012-12' '2013-01' '2013-02' '2013-03'
 '2013-04' '2013-05' '2013-06' '2013-07' '2013-08' '2013-09' '2013-10'
 '2013-11' '2013-12' '2014-01' '2014-02' '2014-03' '2014-04' '2014-05'
 '2014-06' '2014-07' '2014-08' '2014-09' '2014-10' '2014-11' '2014-12'
 '2015-01' '2015-02' '2015-03' '2015-04' '2015-05' '2015-06' '2015-07'
 '2015-08' '2015-09' '2015-10' '2015-11' '2015-12' '2016-01' '2016-02'
 '2016-03' '2016-04' '2016-05' '2016-06' '2016-07' '2016-08' '2016-09'
 '2016-10' '2016-11' '2016-12' '2017-01' '2017-02' '2017-03' '2017-04'
 '2017-05' '2017-06']

## Handling Missing Data

In [61]:
print('null values: \n',)
print(realestate_df.isna().sum(), '\n')
print('Total null values: ' ,realestate_df.isna().sum().sum())

null values:

type          0
zipcode       0
city          0
state         0
metro      1865
           ...
2017-02       0
2017-03       0
2017-04       0
2017-05       0
2017-06       0
Length: 262, dtype: int64

Total null values:  3144405

## Duplicate Data in a Data-Frame:

In [62]:
duplicated_rows_df= realestate_df[realestate_df.duplicated()]
print('number of duplicate rows: ', duplicated_rows_df.shape)

number of duplicate rows:  (0, 262)

## FIll Nan Rows with Average values

In [63]:
yeardf= realestate_df.iloc[:, 136:]
m = yeardf.mean(axis=1)
for i, col in enumerate(yeardf):
    yeardf.iloc[:, i] = yeardf.iloc[:, i].fillna(m)
yeardf.head()

,2007-01,2007-02,2007-03,2007-04,2007-05,2007-06,2007-07,2007-08,2007-09,2007-10,...,2016-09,2016-10,2016-11,2016-12,2017-01,2017-02,2017-03,2017-04,2017-05,2017-06
0,774500.0,767600.0,759000.0,744200.0,729900.0,721300.0,726900.0,743600.0,757300.0,759600.0,...,1137500,1137700,1152700,1156000.0,1140200,1130000,1131900,1149600,1198400,1247000
1,318000.0,318600.0,319200.0,319400.0,320700.0,321500.0,322400.0,324000.0,324500.0,323800.0,...,318200,318100,318800,320200.0,320800,322000,323800,326100,327800,329100
2,386400.0,386300.0,387700.0,389200.0,390600.0,392300.0,395800.0,397900.0,398200.0,398200.0,...,401900,406000,414100,417800.0,417400,418400,414100,404100,406400,415500
3,127000.0,128000.0,128300.0,128500.0,129000.0,130000.0,130800.0,131000.0,130700.0,130600.0,...,113800,113900,114100,114500.0,114900,115000,114700,114700,114800,114700
4,237000.0,237800.0,237600.0,237400.0,237700.0,237400.0,236100.0,235100.0,234400.0,233800.0,...,198800,199200,200100,201500.0,203000,205100,206700,206500,206200,206700

In [64]:
realecateg=realestate_df.iloc[:, :7]
realecateg

,type,zipcode,city,state,metro,county,size_rank
0,ZHVI,10025,New York,NY,New York,New York,1
1,ZHVI,60657,Chicago,IL,Chicago,Cook,2
2,ZHVI,60614,Chicago,IL,Chicago,Cook,3
3,ZHVI,79936,El Paso,TX,El Paso,El Paso,4
4,ZHVI,60640,Chicago,IL,Chicago,Cook,5
...,...,...,...,...,...,...,...
29106,ZRI,12720,Bethel,NY,NaN,Sullivan,15907
29107,ZRI,1338,Shelburne Falls,MA,Greenfield Town,Franklin,15908
29108,ZRI,21405,Annapolis,MD,Baltimore,Anne Arundel,15909
29109,ZRI,85220,Apache Junction,AZ,Phoenix,Pinal,15910
29110,ZRI,89595,Reno,NV,Reno,Washoe,15911

In [65]:
realestate_df= pd.concat([realecateg, yeardf], axis=1)
realestate_df

,type,zipcode,city,state,metro,county,size_rank,2007-01,2007-02,2007-03,...,2016-09,2016-10,2016-11,2016-12,2017-01,2017-02,2017-03,2017-04,2017-05,2017-06
0,ZHVI,10025,New York,NY,New York,New York,1,774500.0000,767600.0000,759000.0000,...,1137500,1137700,1152700,1156000.0,1140200,1130000,1131900,1149600,1198400,1247000
1,ZHVI,60657,Chicago,IL,Chicago,Cook,2,318000.0000,318600.0000,319200.0000,...,318200,318100,318800,320200.0,320800,322000,323800,326100,327800,329100
2,ZHVI,60614,Chicago,IL,Chicago,Cook,3,386400.0000,386300.0000,387700.0000,...,401900,406000,414100,417800.0,417400,418400,414100,404100,406400,415500
3,ZHVI,79936,El Paso,TX,El Paso,El Paso,4,127000.0000,128000.0000,128300.0000,...,113800,113900,114100,114500.0,114900,115000,114700,114700,114800,114700
4,ZHVI,60640,Chicago,IL,Chicago,Cook,5,237000.0000,237800.0000,237600.0000,...,198800,199200,200100,201500.0,203000,205100,206700,206500,206200,206700
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29106,ZRI,12720,Bethel,NY,NaN,Sullivan,15907,1165.7250,1165.7250,1165.7250,...,1185,1181,1174,1167.0,1156,1162,1175,1194,1202,1206
29107,ZRI,1338,Shelburne Falls,MA,Greenfield Town,Franklin,15908,1613.8375,1613.8375,1613.8375,...,1769,1772,1775,1780.0,1786,1790,1797,1798,1796,1795
29108,ZRI,21405,Annapolis,MD,Baltimore,Anne Arundel,15909,3551.8625,3551.8625,3551.8625,...,4048,4005,3888,3729.0,3563,3493,3474,3496,3488,3471
29109,ZRI,85220,Apache Junction,AZ,Phoenix,Pinal,15910,917.5625,917.5625,917.5625,...,1007,1018,1035,1052.0,1061,1060,1058,1065,1074,1080
29110,ZRI,89595,Reno,NV,Reno,Washoe,15911,800.3750,800.3750,800.3750,...,872,877,871,863.0,843,826,816,820,838,848

## Fill NA Metro

In [66]:
realestate_df.metro.fillna("Empty", inplace=True)
realestate_df

,type,zipcode,city,state,metro,county,size_rank,2007-01,2007-02,2007-03,...,2016-09,2016-10,2016-11,2016-12,2017-01,2017-02,2017-03,2017-04,2017-05,2017-06
0,ZHVI,10025,New York,NY,New York,New York,1,774500.0000,767600.0000,759000.0000,...,1137500,1137700,1152700,1156000.0,1140200,1130000,1131900,1149600,1198400,1247000
1,ZHVI,60657,Chicago,IL,Chicago,Cook,2,318000.0000,318600.0000,319200.0000,...,318200,318100,318800,320200.0,320800,322000,323800,326100,327800,329100
2,ZHVI,60614,Chicago,IL,Chicago,Cook,3,386400.0000,386300.0000,387700.0000,...,401900,406000,414100,417800.0,417400,418400,414100,404100,406400,415500
3,ZHVI,79936,El Paso,TX,El Paso,El Paso,4,127000.0000,128000.0000,128300.0000,...,113800,113900,114100,114500.0,114900,115000,114700,114700,114800,114700
4,ZHVI,60640,Chicago,IL,Chicago,Cook,5,237000.0000,237800.0000,237600.0000,...,198800,199200,200100,201500.0,203000,205100,206700,206500,206200,206700
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29106,ZRI,12720,Bethel,NY,Empty,Sullivan,15907,1165.7250,1165.7250,1165.7250,...,1185,1181,1174,1167.0,1156,1162,1175,1194,1202,1206
29107,ZRI,1338,Shelburne Falls,MA,Greenfield Town,Franklin,15908,1613.8375,1613.8375,1613.8375,...,1769,1772,1775,1780.0,1786,1790,1797,1798,1796,1795
29108,ZRI,21405,Annapolis,MD,Baltimore,Anne Arundel,15909,3551.8625,3551.8625,3551.8625,...,4048,4005,3888,3729.0,3563,3493,3474,3496,3488,3471
29109,ZRI,85220,Apache Junction,AZ,Phoenix,Pinal,15910,917.5625,917.5625,917.5625,...,1007,1018,1035,1052.0,1061,1060,1058,1065,1074,1080
29110,ZRI,89595,Reno,NV,Reno,Washoe,15911,800.3750,800.3750,800.3750,...,872,877,871,863.0,843,826,816,820,838,848

In [67]:
realestate_df.isna().sum().sum()

0

##  Melting date 2007 -2017 columns on a single column in Data-Set:

In [68]:
yeardf= yeardf.columns.tolist() # Listado de años y meses de la df realstate
#yearlist
realestate_df = pd.melt(realestate_df, id_vars=['type','zipcode','city','state','metro','county','size_rank'], value_vars= yeardf , var_name='date', value_name= 'Value')
realestate_df

,type,zipcode,city,state,metro,county,size_rank,date,Value
0,ZHVI,10025,New York,NY,New York,New York,1,2007-01,774500.0
1,ZHVI,60657,Chicago,IL,Chicago,Cook,2,2007-01,318000.0
2,ZHVI,60614,Chicago,IL,Chicago,Cook,3,2007-01,386400.0
3,ZHVI,79936,El Paso,TX,El Paso,El Paso,4,2007-01,127000.0
4,ZHVI,60640,Chicago,IL,Chicago,Cook,5,2007-01,237000.0
...,...,...,...,...,...,...,...,...,...
3667981,ZRI,12720,Bethel,NY,Empty,Sullivan,15907,2017-06,1206.0
3667982,ZRI,1338,Shelburne Falls,MA,Greenfield Town,Franklin,15908,2017-06,1795.0
3667983,ZRI,21405,Annapolis,MD,Baltimore,Anne Arundel,15909,2017-06,3471.0
3667984,ZRI,85220,Apache Junction,AZ,Phoenix,Pinal,15910,2017-06,1080.0
3667985,ZRI,89595,Reno,NV,Reno,Washoe,15911,2017-06,848.0

## Drop NA values

In [69]:
realestate_df = realestate_df.dropna()
print('new dataframe shape: ', realestate_df.shape)
realestate_df

new dataframe shape:  (3667986, 9)

,type,zipcode,city,state,metro,county,size_rank,date,Value
0,ZHVI,10025,New York,NY,New York,New York,1,2007-01,774500.0
1,ZHVI,60657,Chicago,IL,Chicago,Cook,2,2007-01,318000.0
2,ZHVI,60614,Chicago,IL,Chicago,Cook,3,2007-01,386400.0
3,ZHVI,79936,El Paso,TX,El Paso,El Paso,4,2007-01,127000.0
4,ZHVI,60640,Chicago,IL,Chicago,Cook,5,2007-01,237000.0
...,...,...,...,...,...,...,...,...,...
3667981,ZRI,12720,Bethel,NY,Empty,Sullivan,15907,2017-06,1206.0
3667982,ZRI,1338,Shelburne Falls,MA,Greenfield Town,Franklin,15908,2017-06,1795.0
3667983,ZRI,21405,Annapolis,MD,Baltimore,Anne Arundel,15909,2017-06,3471.0
3667984,ZRI,85220,Apache Junction,AZ,Phoenix,Pinal,15910,2017-06,1080.0
3667985,ZRI,89595,Reno,NV,Reno,Washoe,15911,2017-06,848.0

The relevant features we will use in this case are:

1. **zipcode:** code to identify the real estate
2. **city:** name of the city where is located the real estate
3. **state:** name of the state where is located the real estate
4. **county:** name of the county where is located the real estate
5. **date:** date reference for the real estate value 
6. **value:** value of the real estate in a specific date"

## Detecting Outliers in a Data-Set:

##  Change Date column to datetime

In [70]:
realestate_df['date'] = pd.to_datetime(realestate_df['date'], format='%Y-%m')
realstate.info()

NameError: name 'realstate' is not defined

## Creating month and year columns

In [20]:
realestate_df['year'] = pd.DatetimeIndex(realestate_df['date']).year
realestate_df['month'] = pd.DatetimeIndex(realestate_df['date']).month
realestate_df

## Fill zipcode with 0

In [21]:
realestate_df['zipcode']=realestate_df['zipcode'].astype(str)
realestate_df['zipcode'] =realestate_df['zipcode'].apply(lambda x: x.zfill(5))
realestate_df

## Creating ZHVI and ZRI dataframe

In [22]:
rszhvi= realestate_df[ realestate_df['type'].isin(['ZHVI'])]
rszhvi"

In [23]:
rszri= realestate_df[ realestate_df['type'].isin(['ZHVI'])]
rszri

## Histogram RS

In [24]:
#plt.figure(figsize=(4, 4))
#plt.hist(rszhvi['Value'],bins = 30 )
#None

## Real Estate df unique count

In [25]:
for col in realestate_df:
    uni=len(rszhvi[col].unique())
    print('Count of unique values of',col, ':', uni)

Count of unique values of type : 1
Count of unique values of zipcode : 13200
Count of unique values of city : 6975
Count of unique values of state : 49
Count of unique values of metro : 579
Count of unique values of county : 937
Count of unique values of size_rank : 13200
Count of unique values of date : 126
Count of unique values of Value : 19664
Count of unique values of year : 11
Count of unique values of month : 12

## Counts per State Plot

In [26]:
#plt.figure(figsize=(5, 5))
#sns.countplot(y='state', data= rszhvi )
#plt.xlabel('Count', fontsize=12)
#plt.ylabel('State', fontsize=12)
#plt.show()

## Count of citys and countys

In [27]:
cityc = rszhvi.groupby(['city']).size().sort_values(ascending=False)[:]
print(cityc, '\n') 
  
countyc = rszhvi.groupby(['county']).size().sort_values(ascending=False)[:]
print(countyc)

city
New York        13986
Los Angeles     12222
Chicago          6678
Philadelphia     5670
Phoenix          5040
                ...
Talbott           126
Manvel            126
Takoma Park       126
Maple Falls       126
Zumbro Falls      126
Length: 6975, dtype: int64

county
Los Angeles    33138
Washington     21924
Orange         21168
Jefferson      19908
Cook           19530
               ...
Moffat           126
Monongalia       126
Catahoula        126
Montague         126
Zavala           126
Length: 937, dtype: int64

## Relationships Between Value ans Size Rank Real Estate

In [28]:
#sns.jointplot(x=rszhvi['Value'], y=rszhvi['size_rank']);

## Average Value per State

In [29]:
realestate_out = rszhvi.groupby(['zipcode','year','state','city','county'])['Value'].mean().reset_index()
    
#plt.figure(figsize=(5, 5))
#sns.stripplot(x="Value", y="state", data=realestate_out, size= 1 )
#plt.xlabel('State', fontsize=12)
#plt.ylabel('Value Real Estate', fontsize=12)
#plt.show()

## Check the real estate with the maximum mean value over the years

In [30]:
realestate_out[['city','state','Value']].iloc[realestate_out['Value'].idxmax()]

city        Atherton
state             CA
Value    6.25295e+06
Name: 133121, dtype: object

## Basic statistical details of Real Estate values over the States

In [31]:
realestate_out['Value'].describe()

count    1.452000e+05
mean     2.297079e+05
std      2.078295e+05
min      2.712500e+04
25%      1.165146e+05
50%      1.690083e+05
75%      2.710771e+05
max      6.252950e+06
Name: Value, dtype: float64

In [32]:
realestate_out['state'].nunique()

49

## Data Type columns

In [33]:
print('data types: \\n', realestate_df.dtypes)

data types: \n type                 object
zipcode              object
city                 object
state                object
metro                object
county               object
size_rank             int64
date         datetime64[ns]
Value               float64
year                  int64
month                 int64
dtype: object

## Year Real Estate Values Trends

# Agrupacion por zipcode , year , state, Valor promedio

In [34]:
realestate_df2 = rszhvi.groupby(['type','zipcode', 'year','state','city'])['Value'].mean().reset_index()
realestate_df2

In [35]:
#plt.figure(figsize=(7,3))
#g=sns.stripplot (data=realestate_df2, x='year', y= 'Value')
#g.set_yscale(\"log\")\n",
#plt.xticks (rotation=90,fontsize= 12)#ha='right'\n",
#None

In [36]:
#g= sns.FacetGrid(realestate_df2, col_wrap=3, col ='state', aspect=1.20, height=5)\n",
#g.map_dataframe (sns.stripplot, x='year', y= 'Value',hue='year')\n",
#g.add_legend()\n",
#g.set_yticklabels(fontsize= 8 )\n",
#g.set_yticklabels(fontsize= 8 )\n",
#g.set_titles(fontsize= 12 )"

## Mean Value per Zipcode

# Agrupacion por  state, y city  Valor promedio

In [37]:
realestate_df3 = rszhvi.groupby(['state','county','zipcode'])['Value'].mean().sort_values(ascending=False).reset_index()
realestate_df3

      state       county zipcode         Value
0        CA    San Mateo   94027  4.078230e+06
1        CA  Los Angeles   90210  3.507410e+06
2        NY      Suffolk   11976  2.857306e+06
3        CA    San Diego   92067  2.735399e+06
4        CA  Los Angeles   90402  2.617714e+06
...     ...          ...     ...           ...
13195    PA      Cambria   15901  3.457619e+04
13196    OH     Mahoning   44510  3.157349e+04
13197    OH     Mahoning   44507  3.153373e+04
13198    OH     Mahoning   44502  3.116386e+04
13199    OH     Mahoning   44506  3.084337e+04

[13200 rows x 4 columns]

## Mean Values per City

In [38]:
realestate_df4 = rszhvi.groupby(['city'])['Value'].mean().sort_values(ascending=False)[:].reset_index()
realestate_df4

                 city         Value
0            Atherton  4.078230e+06
1          Water Mill  2.857306e+06
2      Portola Valley  2.466803e+06
3              Malibu  2.393843e+06
4     Rancho Santa Fe  2.368692e+06
...               ...           ...
6970  Washington Park  4.354286e+04
6971      River Rouge  4.347381e+04
6972           Ecorse  4.272381e+04
6973   North Braddock  4.268254e+04
6974         Duquesne  4.184921e+04

[6975 rows x 2 columns]

In [39]:
#plt.figure(figsize=(12,10))
#realstate.groupby('city').size().sort_values(ascending=False)[:30].plot.barh()

In [40]:
rszhvi[['city','zipcode','Value']].groupby(['city', 'zipcode']).agg(['count'])

                      Value
                      count
city          zipcode
Abbeville     31001     126
              38601     126
Aberdeen      21001     126
              28315     126
              39730     126
...                     ...
Zion          60099     126
Zionsville    46077     126
Zirconia      28790     126
Zolfo Springs 33890     126
Zumbro Falls  55991     126

[13200 rows x 1 columns]

In [41]:
rszhvi.zipcode.value_counts()

11426    126
95776    126
17222    126
35811    126
91740    126
        ...
30265    126
27302    126
08690    126
44608    126
29583    126
Name: zipcode, Length: 13200, dtype: int64

In [42]:
rszhvi.zipcode.nunique()

13200

## Read listings csv

In [43]:
listings_df= pd.read_csv("data/listings.csv")
listings_df

## Clean zip code Listings

## Check zipcodes greater and less than 5 strings

In [44]:
#listings_df[listings_df['zipcode'].str.len()>5]
#listings_df[listings_df['zipcode'].str.len()<5]"

## Clean zip code Listings > 5 strings

In [45]:
listings_df['zipcode_clean'] = list(listings_df['zipcode'].str.slice(0,5))
listings_df.head()

,accommodates,amenities,availability_30,bathrooms,bed_type,bedrooms,beds,cancellation_policy,city,has_availability,...,review_scores_cleanliness,review_scores_communication,review_scores_location,review_scores_rating,review_scores_value,room_type,state,weekly_price,zipcode,zipcode_clean
0,2.0,"{""Cable TV"",""Wireless Internet"",""Air condition...",24,1.0,Real Bed,1.0,1.0,moderate,sunnysidebronx,NaN,...,10.0,10.0,10.0,100.0,10.0,Private room,NY,NaN,10464,10464
1,4.0,"{TV,Internet,""Wireless Internet"",""Air conditio...",30,1.0,Real Bed,1.0,1.0,flexible,sunnysidebronx,NaN,...,NaN,NaN,NaN,NaN,NaN,Private room,NY,NaN,10464,10464
2,4.0,"{TV,""Cable TV"",Internet,""Wireless Internet"",""A...",30,3.0,Real Bed,3.0,3.0,strict,sunnysidebronx,NaN,...,NaN,NaN,NaN,NaN,NaN,Entire home/apt,NY,NaN,10464,10464
3,3.0,"{TV,Internet,""Wireless Internet"",""Air conditio...",8,1.0,Real Bed,1.0,1.0,strict,long island city,NaN,...,10.0,10.0,10.0,93.0,10.0,Entire home/apt,NY,775.0,10464,10464
4,4.0,"{Internet,""Wireless Internet"",""Air conditionin...",17,1.0,Real Bed,1.0,1.0,moderate,sunnysidebronx,NaN,...,10.0,10.0,10.0,97.0,10.0,Private room,NY,350.0,10464,10464

## Review Null Values for zipcode

In [46]:
print('null values: \n',)
print(listings_df.isna().sum(), '\n')
print('Total null values: ' ,listings_df.isna().sum().sum())

null values:

accommodates                      61
amenities                          0
availability_30                    0
bathrooms                        202
bed_type                           0
bedrooms                          95
beds                             109
cancellation_policy                0
city                              46
has_availability               59824
host_id                            0
id                                 0
instant_bookable                   0
latitude                           0
longitude                          0
metropolitan                       0
name                              41
price                              0
property_type                      4
review_scores_checkin          14346
review_scores_cleanliness      14280
review_scores_communication    14285
review_scores_location         14349
review_scores_rating           14200
review_scores_value            14354
room_type                          0
state                              0
weekly_price                   46386
zipcode                          826
zipcode_clean                    826
dtype: int64

Total null values:  194234

## Checking zipcodes Null

In [47]:
df1 = listings_df[listings_df['zipcode'].isna()]
df1 = listings_df[listings_df['zipcode_clean'].isna()]
df1

## Drop zipcode null from zipcode clean

## Drop zipcode null and > 5 strings  from zipcode clean

In [48]:
listings_df['zipcode_clean'].replace([' ','1m'],np.nan, inplace=True)
listings_df=listings_df.dropna(subset=['zipcode_clean'])
#listings_df
print(listings_df.isna().sum(), '\n')

accommodates                      61
amenities                          0
availability_30                    0
bathrooms                        198
bed_type                           0
bedrooms                          83
beds                              80
cancellation_policy                0
city                              40
has_availability               58995
host_id                            0
id                                 0
instant_bookable                   0
latitude                           0
longitude                          0
metropolitan                       0
name                              40
price                              0
property_type                      4
review_scores_checkin          14071
review_scores_cleanliness      14005
review_scores_communication    14009
review_scores_location         14073
review_scores_rating           13927
review_scores_value            14079
room_type                          0
state                              0
weekly_price                   45627
zipcode                            0
zipcode_clean                      0
dtype: int64

## Checking values space zipcode Listings

In [49]:
#listings_df[listings_df['zipcode']== ' ']

In [50]:
listings_df[listings_df['zipcode_clean'].str.len()<5]
listings_df[listings_df['zipcode_clean'].str.len()>5]

Empty DataFrame
Columns: [accommodates, amenities, availability_30, bathrooms, bed_type, bedrooms, beds, cancellation_policy, city, has_availability, host_id, id, instant_bookable, latitude, longitude, metropolitan, name, price, property_type, review_scores_checkin, review_scores_cleanliness, review_scores_communication, review_scores_location, review_scores_rating, review_scores_value, room_type, state, weekly_price, zipcode, zipcode_clean]
Index: []

[0 rows x 30 columns]

In [51]:
listings_df.shape

(58995, 30)

## Join Listings and Real Estate DFs by zipcode

In [52]:
listings_rs= listings_df.set_index('zipcode_clean').join(realestate_df3.set_index('zipcode'), how='left',lsuffix = '_left', rsuffix = '_right')
listings_rs=listings_rs.reset_index()
listings_rs['zipcode']=listings_rs['zipcode'].str.slice(0,5)
listings_rs

## Check df by zipcode values

In [53]:
#listings_rs[listings_rs['index']== '80249']

## Limit listings df by property type

In [54]:
listings_filt = (listings_rs[listings_rs['property_type'].isin(['Apartment',
'House',
'Condominium',
'Townhouse',
'Loft',
'Bed & Breakfast'])])

## Groupby of listings by price and value

In [55]:
pricevalue_df = listings_filt[['zipcode','city',"property_type",'price','Value']].groupby(['zipcode','city',"property_type"]).agg(['count', 'mean'])
pricevalue_df

                                 price             Value
                                 count        mean count           mean
zipcode city     property_type
02108   boston   Apartment          65  220.169231    65  821225.396825
                 Bed & Breakfast     1  270.000000     1  821225.396825
                 Condominium         5  189.800000     5  821225.396825
                 House               1  690.000000     1  821225.396825
                 Townhouse           1  700.000000     1  821225.396825
...                                ...         ...   ...            ...
80247   denver   Apartment          16   28.937500    16  118458.730159
                 Condominium         2   77.500000     2  118458.730159
                 House               2   46.500000     2  118458.730159
80249   denver   House              27   82.740741    27  192773.809524
99135   new york Apartment           1  340.000000     0            NaN

[1605 rows x 4 columns]

## Check listings df by city

In [56]:
#listings_rs[listings_rs['city']== 'washington']